export const ones = [
  "",
  "یک",
  "دو",
  "سه",
  "چهار",
  "پنج",
  "شش",
  "هفت",
  "هشت",
  "نه",
  "ده",
  "یازده",
  "دوازده",
  "سیزده",
  "چهارده",
  "پانزده",
  "شانزده",
  "هفده",
  "هجده",
  "نوزده",
];

export const tens = [
  "",
  "",
  "بیست و",
  "سی و",
  "چهل و",
  "پنجاه و",
  "شصت و",
  "هفتاد و",
  "هشتاد و",
  "نود و",
];

export const hundreds = [
  "",
  "صد و",
  "دویست و",
  "سیصد و",
  "چهارصد و",
  "پانصد و",
  "ششصد و",
  "هفتصد و",
  "هشتصد و",
  "نهصد و",
];

export const decimalOnes = [
  "",
  "یک",
  "دو",
  "سه",
  "چهار",
  "پنج",
  "شش",
  "هفت",
  "هشت",
  "نه",
];

export const decimalTens = [
  "",
  "",
  "بیست و",
  "سی و",
  "چهل و",
  "پنجاه و",
  "شصت و",
  "هفتاد و",
  "هشتاد و",
  "نود و",
];

export const decimalHundreds = [
  "",
  "صد و",
  "دویست و",
  "سیصد و",
  "چهارصد و",
  "پانصد و",
  "ششصد و",
  "هفتصد و",
  "هشتصد و",
  "نهصد و",
];

export const decimalTeens = [
  "ده",
  "یازده",
  "دوازده",
  "سیزده",
  "چهارده",
  "پانزده",
  "شانزده",
  "هفده",
  "هجده",
  "نوزده",
];

export const bigNumbers = ["", "هزار و", "میلیون و", "میلیارد و", "تریلیون و"];
