export const ones: string[] = [
  "",
  "یک",
  "دو",
  "سه",
  "چهار",
  "پنج",
  "شش",
  "هفت",
  "هشت",
  "نه",
  "ده",
  "یازده",
  "دوازده",
  "سیزده",
  "چهارده",
  "پانزده",
  "شانزده",
  "هفده",
  "هجده",
  "نوزده",
];

export const tens: string[] = [
  "",
  "",
  "بیست و",
  "سی و",
  "چهل و",
  "پنجاه و",
  "شصت و",
  "هفتاد و",
  "هشتاد و",
  "نود و",
];

export const hundreds: string[] = [
  "",
  "صد و",
  "دویست و",
  "سیصد و",
  "چهارصد و",
  "پانصد و",
  "ششصد و",
  "هفتصد و",
  "هشتصد و",
  "نهصد و",
];

export const decimalOnes: string[] = [
  "",
  "یک",
  "دو",
  "سه",
  "چهار",
  "پنج",
  "شش",
  "هفت",
  "هشت",
  "نه",
];

export const decimalTens: string[] = [
  "",
  "",
  "بیست و",
  "سی و",
  "چهل و",
  "پنجاه و",
  "شصت و",
  "هفتاد و",
  "هشتاد و",
  "نود و",
];

export const decimalHundreds: string[] = [
  "",
  "صد و",
  "دویست و",
  "سیصد و",
  "چهارصد و",
  "پانصد و",
  "ششصد و",
  "هفتصد و",
  "هشتصد و",
  "نهصد و",
];

export const decimalTeens: string[] = [
  "ده",
  "یازده",
  "دوازده",
  "سیزده",
  "چهارده",
  "پانزده",
  "شانزده",
  "هفده",
  "هجده",
  "نوزده",
];

export const bigNumbers: string[] = [
  "",
  "هزار و",
  "میلیون و",
  "میلیارد و",
  "تریلیون و",
];

export interface IMoneyType {
  toNumber: string;
  toChar: string;
}
